app/controllers/events_controller.rb

  def create
    new_params = event_params

    new_params[:categories] = new_params[:categories].map do |cat|
      Category.find(cat)
    end

    @event = Event.new(new_params)
    @event.user = @current_user

    if @event.save
---
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "events" ("title", "hosted_by", "date", "location", "price", "created_at", "updated_at", "img_url", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @event.update(event_params)
---
UPDATE "events" SET "price" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["price", "$2.00"], ["updated_at", "2020-06-15 22:44:01.931729"], ["id", 8]]

  def event_to_category
    @category = Category.find(params[:category_id])
    @event = Event.find(params[:event_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]